brew "ack"
brew "codesnap"
brew "curl" # needed for postgres
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "entr" # needed for bat-extras
brew "gcc" # needed for postgres
brew "gh"
brew "git"
brew "git-lfs"
brew "gpg"
brew "gnupg" # needed for GPG and pinentry
brew "icu4c" # needed for postgres
brew "imagemagick"
brew "kubernetes-cli"
brew "libpq"
brew "libsass"
brew "libtool"
brew "libyaml"
brew "mas"
brew "mingw-w64" # use for rust binary compilations
brew "nvim"
brew "openssl"
brew "ossp-uuid" # needed for postgres
brew "pinentry-mac"
brew "pkg-config" # needed for postgres
brew "pygments"
brew "readline" # needed for postgres# used by mise
brew "xdg-ninja"
brew "zlib" # needed for postgres

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "balenaetcher"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "fleet"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "linear-linear"
cask "logitech-g-hub"
cask "meld"
cask "obsidian"
cask "orangedrangon-android-messages"
cask "raycast"
cask "rubymine"
cask "runjs"
cask "rustrover"
cask "slack"
cask "tailscale-app"
cask "telegram"
cask "warp"
cask "webstorm"
cask "zed"
cask "zoom"

mas "ColorSlurp", id: 1287239339
mas "Sequence Diagram for Mac", id: 1195426709
mas "Xcode", id: 497799835
