tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "hashicorp/tap"
tap "git-chglog/git-chglog"
tap "git-duet/tap"
tap "xwmx/taps"
brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cask"
brew "coreutils"
brew "curl"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "gpg"
brew "grpcui"
brew "grpcurl"
brew "hashicorp/tap/vault"
brew "imagemagick"
brew "kubectx"
brew "kubernetes-cli"
brew "libsass"
brew "libtool"
brew "libyaml"
brew "mas"
brew "minikube"
brew "mutagen-io/mutagen/mutagen"
brew "nb"
brew "nmap"
brew "openssl"
brew "openssl@1.1"
brew "pandoc"
brew "pkg-config"
brew "pygments"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "terminal-notifier"
brew "thefuck"
brew "tig"
brew "w3m"
brew "watch"
brew "xz"
brew "z"
cask "1password"
cask "adoptopenjdk"
cask "android-messages"
cask "appcleaner"
cask "authy"
cask "dbeaver-community"
cask "discord"
cask "docker-edge"
cask "envkey"
cask "evernote"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "iterm2"
cask "logitech-g-hub"
cask "microsoft-teams"
cask "postman"
cask "rubymine"
cask "runjs"
cask "signal"
cask "slack"
cask "sourcetree"
cask "telegram"
cask "typora"
cask "visual-studio-code"
cask "ytmdesktop-youtube-music"
cask "zoom"
mas "Facebook Messenger", id: 1480068668
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "Sequence Diagram for Mac", id: 1195426709
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
