tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "codeship/taps"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/cask"
tap "git-chglog/git-chglog"
tap "git-duet/tap"
tap "heroku/brew"
tap "prisma/prisma"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cask"
brew "coreutils"
brew "gcc"
brew "git"
brew "git-chglog"
brew "git-duet"
brew "gnupg"
brew "go"
brew "heroku"
brew "imagemagick"
brew "kubectx"
brew "kubernetes-cli"
brew "libtool"
brew "libyaml"
brew "mas"
brew "openssl"
brew "mysql"
brew "openssl@1.1"
brew "pkg-config"
brew "postgresql"
brew "prisma"
brew "python"
brew "redis"
brew "speedtest-cli"
brew "sqlite"
brew "terminal-notifier"
brew "watch"
brew "yarn"
brew "z"
cask "appcleaner"
cask "authy"
cask "caskroom/fonts/font-fira-code"
cask "codeship/taps/jet"
cask "discord"
cask "docker-edge"
cask "envkey"
cask "evernote"
cask "firefox"
cask "franz"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "keybase"
cask "marshallofsound-google-play-music-player"
cask "microsoft-teams"
cask "minikube"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "sourcetree"
cask "steam"
cask "synergy"
cask "typora"
cask "vectr"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
