tap "homebrew/bundle"
tap "git-chglog/git-chglog"
tap "git-duet/tap"
tap "hashicorp/tap"
tap "mutagen-io/mutagen"
tap "xwmx/taps"
brew "ansible"
brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cask"
brew "coreutils"
brew "curl"
brew "doctl"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "gpg"
brew "grpcui"
brew "grpcurl"
brew "hashicorp/tap/vault"
brew "imagemagick"
brew "kafka"
brew "kubectx"
brew "kubernetes-cli"
brew "libpq"
brew "libsass"
brew "libtool"
brew "libyaml"
brew "lsd"
brew "mas"
brew "minikube"
brew "mutagen"
brew "neonctl"
brew "nmap"
brew "openssl"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "powerlevel10k"
brew "pygments"
brew "ripgrep"
brew "rover"
brew "shellcheck"
brew "speedtest-cli"
brew "telnet"
brew "terminal-notifier"
brew "thefuck"
brew "tig"
brew "w3m"
brew "watch"
brew "xz"
brew "z"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "envkey"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "intellij-idea"
cask "iterm2"
cask "logitech-g-hub"
cask "offset-explorer"
cask "orangedrangon-android-messages"
cask "postman"
cask "rubymine"
cask "runjs"
cask "slack"
cask "sourcetree"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "zoom"
mas "Facebook Messenger", id: 1480068668
mas "Magnet", id: 441258766
mas "Sequence Diagram for Mac", id: 1195426709
mas "Xcode", id: 497799835
