brew "awk" # needed for yadm
brew "bat"
brew "bat-extras"
brew "curl" # needed for postgres
brew "delta" # needed for bat-extras
brew "doctl"
brew "entr" # needed for bat-extras
brew "gcc" # needed for postgres
brew "gh"
brew "git"
brew "git-lfs"
brew "gpg"
brew "gnupg" # needed for GPG and pinentry
brew "icu4c" # needed for postgres
brew "imagemagick"
brew "kubectx"
brew "kubernetes-cli"
brew "libpq"
brew "libsass"
brew "libtool"
brew "libyaml"
brew "lsd"
brew "mas"
brew "minikube"
brew "mise"
brew "openssl"
brew "ossp-uuid" # needed for postgres
brew "pinentry-mac"
brew "pkg-config" # needed for postgres
brew "powerlevel10k"
brew "pygments"
brew "readline" # needed for postgres
brew "ripgrep" # used by bat-extras
brew "shellcheck"
brew "tmux"
brew "watchexec" # used by mise
brew "xdg-ninja"
brew "yadm"
brew "z"
brew "zlib" # needed for postgres
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lilex-nerd-font"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "linear-linear"
cask "obsidian"
cask "orangedrangon-android-messages"
cask "rubymine"
cask "runjs"
cask "slack"
cask "tailscale"
cask "telegram"
cask "warp"
cask "zoom"

mas "ColorSlurp", id: 1287239339
mas "Sequence Diagram for Mac", id: 1195426709
mas "Xcode", id: 497799835
